# 2 Определить совподает ли четность двух чисел.

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

if a % 2 == b % 2:
    print("Четность двух чисел совпадает")
else: 
    print("Числа имеют разную четность")


