# 3 Определить является ли число четырехзначным.

number = input("Введите целое число: ")

if len(number) == 4:
     print("YES")
else: 
    print("NO")
